stm32-rs/stm32l0xx-hal/src/adc.rs
        // power down the ADC, since we are finishing up
        new_adc.power_down();

        // if we had an error before, return it
        match res {
            Err((t,e)) => Err((new_adc, adc_chan, t,Error::DmaError(e))),
            Ok(t) => Ok((new_adc,adc_chan, t))
        }
    }
}

impl<State> Adc<State> {
    pub fn release(self) -> ADC {
        self.rb
    }

    fn power_up(&mut self) {
        self.rb.isr.modify(|_, w| w.adrdy().set_bit());
        self.rb.cr.modify(|_, w| w.aden().set_bit());
        while self.rb.isr.read().adrdy().bit_is_clear() {}
    }

    fn power_down(&mut self) {
        self.rb.cr.modify(|_, w| w.addis().set_bit());
        self.rb.isr.modify(|_, w| w.adrdy().set_bit());
        while self.rb.cr.read().aden().bit_is_set() {}
    }

    fn configure<AdcChan : Into<Channels>>(&mut self,
        channels: AdcChan,
        cont:     bool,
        trigger:  Option<Trigger>,
    )
    {
        self.rb.cfgr1.write(|w| {
            w
                .res().bits(self.precision as u8)
                .cont().bit(cont)
                .align().bit(self.align == Align::Left)
                // If we are doing a continuous DMA, then we enable this bit
                .dmacfg().bit(cont)
                // Generate DMA requests
                .dmaen().set_bit();

            if let Some(trigger) = trigger {
                // Select hardware trigger
                w.extsel().bits(trigger as u8);
                // Enable hardware trigger on rising edge
                w.exten().rising_edge();
            }

            w
        });

        self.rb
            .smpr
            .modify(|_, w| w.smp().bits(self.sample_time as u8));

        self.rb.chselr.write(|w|
            // Safe, as long as there are no `Channel` implementations that
            // define invalid values.
            unsafe { w.bits(Into::<Channels>::into(channels).flags) }
        );

        self.rb.isr.modify(|_, w| w.eos().set_bit());
        self.rb.cr.modify(|_, w| w.adstart().set_bit());
    }
}

impl<WORD, PIN> OneShot<Adc<Ready>, WORD, PIN> for Adc<Ready>
where
    WORD: From<u16>,
    PIN: Channel<Adc<Ready>, ID = u8>,
{
    type Error = ();

    fn read(&mut self, _: &mut PIN) -> nb::Result<WORD, Self::Error> {
        self.power_up();
        self.configure(Channels { flags: 0x1 << PIN::channel() }, false, None);

        while self.rb.isr.read().eos().bit_is_clear() {}

        let res = self.rb.dr.read().bits() as u16;
        let val = if self.align == Align::Left && self.precision == Precision::B_6 {
            res << 8
        } else {
            res
        };

        self.power_down();
        Ok(val.into())
    }
}

// Since `Adc` is used in the error variant of a `Result`, it needs to
// implement `Debug` for methods like `unwrap` to work. We can't just
// derive `Debug`, without requiring all type parameters to be
// `Debug`, which seems to restrictive. So we make a version that only
// prints out the _state, which seeems more useful anyways
impl<State :  fmt::Debug> fmt::Debug for Adc<State> {
    fn fmt(&self, f: &mut fmt::Formatter) -> fmt::Result {
        write!(f, "Adc <{:?}>", self._state)
    }
}

/// Indicates that the ADC peripheral is ready
#[derive(Debug)]
pub struct Ready;

/// Indicates that the ADC peripheral is performing continuous DMA conversions
pub struct ActiveContinuousDMA<DmaChan, Buf> {
    transfer: dma::Transfer<DmaToken, DmaChan, Buf, dma::Started>,
    buffer:   Buffer,
}

/// Indicates that the ADC peripheral is performing a single set of DMA conversions
pub struct ActiveOneShotDMA<DmaChan, AdcChan, Buf> {
    transfer: dma::Transfer<DmaToken, DmaChan, Buf, dma::Started>,
    adc_chan: AdcChan,
}


/// A collection of channels
///
/// Used to set up multi-channel conversions.
pub struct Channels {
    flags: u32,
}

impl Channels {
    /// Adds a channel to the collection
    pub fn add<C>(&mut self, _: C)
        where C: Channel<Adc<Ready>, ID=u8>
    {
        self.flags |= 0x1 << C::channel()
    }
}

impl<C> From<C> for Channels
    where C: Channel<Adc<Ready>, ID=u8>
{
    fn from(channel: C) -> Self {
        let mut c = Channels { flags: 0 };
        c.add(channel);
        c
    }
}


/// Hardware triggers that can start an ADC conversion
#[repr(u8)]
pub enum Trigger {
    /// TRG0
    TIM6_TRGO = 0b000,

    /// TRG1
    TIM21_CH2 = 0b001,

    /// TRG2
    TIM2_TRGO = 0b010,

    /// TRG3
    TIM2_CH4 = 0b011,

    /// TRG4
    TIM22_TRGO = 0b100,

    /// TRG5
    ///
    /// Only available on Category 5 devices.
    #[cfg(any(feature = "stm32l072", feature = "stm32l082"))]
    TIM2_CH3 = 0b101,

    /// TRG6
    TIM3_TRGO = 0b110,

    /// TRG7
    EXTI11 = 0b111,
}


/// Provides access to the buffer that the DMA writes ADC values into
///
/// Since the DMA transfer takes ownership of the buffer, we need to access it
/// with unsafe means. This struct is a safe wrapper around this unsafe access.
struct Buffer {
    ptr: *const u16,
    len: u16,
    pos: u16,

    /// Indicates order of read and write indices
    ///
    /// This is initially `false`, indicating that the read position (the `pos`
    /// field) is smaller than or equal to the write position (internally
    /// managed by the DMA peripheral).
    ///
    /// Once the write position wraps around the buffer boundary, this becomes
    /// `true` until the read position also wraps around.
    r_gt_w: bool,
}

impl Buffer {
    fn read<T, C, B>(&mut self, transfer: &dma::Transfer<T, C, B, dma::Started>)
        -> Option<Result<u16, Error>>
        where C: dma::Channel
    {
        let transfer_state = self.transfer_state(transfer);
        if self.check_overrun(transfer_state) {
            return Some(Err(Error::BufferOverrun));
        }

        if self.pos == transfer_state.pos {
            // No overrun detected, but read and write positions are equal. This
            // can only mean that the buffer is empty.
            return None;
        }

        // Safe, as we know that `ptr` and `len` define a valid buffer, and we
        // make sure that `pos <= len`. There's a race condition between this
        // line and the DMA peripheral, of course, but we take care of that with
        // these overrun checks.
        //
        // The cast is fine too. This is a 32-bit platform, so casting a `u16`
        // to an `isize` will never truncate the value.
        compiler_fence(Ordering::SeqCst);
        let value = unsafe { *self.ptr.offset(self.pos as isize) };
        compiler_fence(Ordering::SeqCst);

        // At this point we know that there was no overrun before we started
        // reading, but of course the DMA might have overtaken us since that
        // check. Let's check again. If there's still no overrun, we know that
        // our value is valid.
        let transfer_state = self.transfer_state(transfer);
        if self.check_overrun(transfer_state) {
            // Strictly speaking, the overrun might have happened after our
            // read, and `value` might be valid. No way to know for sure though,
            // so let's assume overrun.
            return Some(Err(Error::BufferOverrun));
        }

