stm32-rs/stm32l0xx-hal/src/adc.rs
        // Now we know that the value we read is totally fine. Let's advance the
        // read position to finish up here.
        self.pos = self.pos.wrapping_add(1);
        if self.pos == 0 || self.pos >= self.len {
            // We advanced beyond the end of the buffer, which means we need to
            // wrap around to the beginning.
            self.pos    = 0;
            self.r_gt_w = false;
        }

        Some(Ok(value))
    }

    fn transfer_state<T, C, B>(&self,
        transfer: &dma::Transfer<T, C, B, dma::Started>,
    )
        -> TransferState
        where C: dma::Channel
    {
        let (remaining, half, complete) = transfer.state();
        transfer.clear_flags();

        // Let's translate what we got from the DMA peripheral into a write
        // position that we can compare with our read position.
        let pos = self.len - remaining;

        TransferState {
            pos,
            half,
            complete,
        }
    }

    fn check_overrun(&mut self, transfer_state: TransferState) -> bool {
        let overrun = self.check_overrun_inner(transfer_state);

        if overrun {
            // An overrun occured, but that is not a catastrophic error. Values
            // got lost, but that doesn't mean we can't read the new values
            // starting now. Let's get the buffer into a consistent state to
            // make that possible.
            //
            // There are various ways to go about this. What we're doing here is
            // to throw away all values in the buffer and start again with an
            // empty buffer, because that minimizes the likelihood of getting
            // another overrun right away.
            //
            // Maybe doing the opposite, setting the read position so that the
            // buffer is full, to minimize lost values, would be better. But
            // then we should give the user the option to empty the buffer
            // manually. I've chosen to go with the simpler option for now.
            self.pos    = transfer_state.pos;
            self.r_gt_w = false;
        }

        overrun
    }

    fn check_overrun_inner(&mut self, transfer_state: TransferState) -> bool {
        if transfer_state.half && transfer_state.complete {
            // Each time we attempt a read, we clear both flags. If both flags
            // are set, then basically anything could have happened in between,
            // so we have to assume an overrun.
            //
            // Please note that it's possible that the DMA has written beyond
            // the half point and wrapped around, causing both of the flags to
            // be set, without passing our current reading position. However,
            // there's no way to distinguish this case from the DMA having
            // passed those marks multiple times, so we have to be conservative
            // and assume an overrun.
            return true;
        }

        if transfer_state.complete {
            // The write has wrapped beyond the buffer boundary and started
            // again at the beginning of the buffer. This is completely normal,
            // but it affects how we detect an overrun.

            if self.r_gt_w {
                // The read position was greater than the write position, so if
                // the write position wrapped, it must have overtaken the read
                // position. This is an overrun.
                return true;
            }

            // The write position has wrapped, so now the read position needs
            // to be greater than the write position.
            self.r_gt_w = true;
        }

        // At this point we know that everything _could_ be alright, judging
        // from the combination of flags we checked so far. We still need to
        // compare read and write positions to make sure that we don't actually
        // have an overrun.
        if self.r_gt_w {
            self.pos <= transfer_state.pos
        }
        else {
            self.pos > transfer_state.pos
        }
    }
}


/// Internal struct to represent the current state of the DMA transfer
#[derive(Clone, Copy, Debug)]
struct TransferState {
    pos:      u16,
    half:     bool,
    complete: bool,
}


/// Iterator over buffered ADC values
pub struct ReadAvailable<'r, T, C, B> {
    buffer:   &'r mut Buffer,
    transfer: &'r dma::Transfer<T, C, B, dma::Started>,
}

impl<T, C, B> Iterator for ReadAvailable<'_, T, C, B>
    where C: dma::Channel
{
    type Item = Result<u16, Error>;

    fn next(&mut self) -> Option<Self::Item> {
        self.buffer.read(self.transfer)
    }
}


/// Used for DMA transfers
///
/// This is an internal implementation detail. It is only public because it
/// leaks out of a public API in the form of a `where` clause.
pub struct DmaToken(());


/// Represents an ADC error
#[derive(Debug)]
pub enum Error {
    /// Indicates that converted data was not read in time
    ///
    /// This happens if either the user or the DMA (depending on mode) did not
    /// read the converted value before another one was ready.
    AdcOverrun,

    /// Indicates that values in the internal buffer have been overwritten
    ///
    /// This is not a critical error, as a circular buffer is used, and the DMA
    /// just keeps writing more values. It does mean that some values in the
    /// buffer were overwritten though.
    BufferOverrun,
    ///we also inherit dma errors
    DmaError(dma::Error),
}


macro_rules! int_adc {
    ($($Chan:ident: ($chan:expr, $en:ident)),+ $(,)*) => {
        $(
            pub struct $Chan;

            impl $Chan {
                pub fn new() -> Self {
                    Self {}
                }

                pub fn enable(&mut self, adc: &mut Adc<Ready>) {
                    adc.rb.ccr.modify(|_, w| w.$en().set_bit());
                }

                pub fn disable(&mut self, adc: &mut Adc<Ready>) {
                    adc.rb.ccr.modify(|_, w| w.$en().clear_bit());
                }
            }

            impl Channel<Adc<Ready>> for $Chan {
                type ID = u8;

                fn channel() -> u8 {
                    $chan
                }
            }
        )+
    };
}

macro_rules! adc_pins {
    ($($Chan:ty: ($pin:ty, $chan:expr)),+ $(,)*) => {
        $(
            impl Channel<Adc<Ready>> for $pin {
                type ID = u8;

                fn channel() -> u8 { $chan }
            }
        )+
    };
}

